app/controllers/api/v1/follows_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "follows"."user_follower_id" FROM "follows" WHERE "follows"."user_id" = $1  [["user_id", 1]]
INSERT INTO "followeds" ("user_id", "followed", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["followed", 1], ["username", "user3"], ["created_at", "2022-04-07 15:01:30.981181"], ["updated_at", "2022-04-07 15:01:30.981181"]]
INSERT INTO "follows" ("user_id", "user_follower_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["user_follower_id", 2], ["created_at", "2022-04-07 15:01:43.453480"], ["updated_at", "2022-04-07 15:01:43.453480"]]
---
  def create
   @follow = Follow.new(follow_params)
   user = User.find(params[:follow][:user_id])
   user_followers = user.follows.pluck(:user_follower_id)
   unless user_followers.include?(params[:follow][:user_follower_id])
    result =  (@follow.save) ? "you followed the user" :  "Error accured"

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "followeds" ("user_id", "followed", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["followed", 1], ["username", "user3"], ["created_at", "2022-04-07 15:01:30.981181"], ["updated_at", "2022-04-07 15:01:30.981181"]]
---
  def update_user_followed_list
   user = User.find(params[:follow][:user_id])
   Followed.create(user_id: params[:follow][:user_follower_id],username: user.username,followed: params[:follow][:user_id])