app/controllers/api/v1/tweet_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
 def user_tweets
   user = User.find(params[:id])

INSERT INTO "tweets" ("user_id", "tweet", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["tweet", "This is my tweet"], ["created_at", "2022-04-05 15:12:17.143080"], ["updated_at", "2022-04-05 15:12:17.143080"]]
---
 def create
  @tweet = Tweet.new(tweet_params)
  if @tweet.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "follows"."user_follower_id" FROM "follows" WHERE "follows"."user_id" = $1  [["user_id", 2]]
SELECT "tweets".* FROM "tweets" WHERE (user_id IN(4,3)) ORDER BY created_at DESC
---
 def user_followers_tweet
   user = User.find(params[:id])
   user_followers = user.follows.pluck(:user_follower_id)
   user_follower_tweets = Tweet.where("user_id IN(?)", user_followers).order('created_at DESC')