app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def create_user_api_token
    user = User.find_by_email(params[:user][:email])
    user_token = User.generate_jwt_token(user[:id])
    user.update_attribute(:user_token,user_token)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "user1@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "user_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["user_token", "eyJhbGciOiJIUzI1NiJ9.eyJpZCI6MSwiZXhwIjoxNjU0MzM4NzA2fQ.xtXpM7Fb3NOfl1VHOU-_TziiQeqtdbaAuEh8yZFy7S0"], ["updated_at", "2022-04-05 10:31:46.094974"], ["id", 1]]